{
  "app": {
    "name": "markdown-json",
    "cwd": "./",
    "src": "posts",
    "filePattern": "**/*.md",
    "ignore": "*(icon|input)*",
    "dist": "src/allPosts.json",
    "metadata": true,
    "server": false,
    "port": 3001,
    "version": "1.5.1"
  },
  "data": [
    {
      "id": "src__building-your-first-budget",
      "contents": "<p>Achieving a healthier financial standing doesn&#39;t start with sporadic spending and ignoring each item on your statement as you pay it month to month. By building and following a budget, you are able to be the one in control and have a strong understanding of what goes in and out of your pocket every month.</p>\n<p>Having an understanding of the different components to a budget as well as following some helpful organizational tips can set you up to make meaningful strides to getting rid of debts. These steps will set up a solid foundation to prepare for life <em>before</em> and after retirement.</p>\n<h3 id=\"outlining-income\">Outlining Income</h3>\n<p>Before anyone can spend money, you have to earn it. Writing down or adding in your monthly income to a spreadsheet will help you visualize the size of the &#39;pie&#39; you have to work with. Even if you know this number, it will helpful to have it written down to compare to the expenses and discretionary spending as you go along.</p>\n<h3 id=\"acknowledging-debts\">Acknowledging Debts</h3>\n<p>No matter how much you try to forget and sweep debts and loans under the rug, they aren&#39;t going anywhere. Writing these down in black and white give you a clear goal of where you are headed. By preparing a budget with these values included, you will have a direct, positive impact in getting them under control as quickly as possible.</p>\n<h3 id=\"list-your-essential-expenses\">List Your Essential Expenses</h3>\n<p>On a piece of paper or in a spreadsheet, list out all of the essential items that you have to pay for every month. I&#39;ve created a sample sheet below, I&#39;ll mention the items in blue a little later. Take a look through to see the types of items I&#39;ve included:</p>\n<p>[Table of expenses]</p>\n<p>There are 4 main categories that you should consider: housing, food, transportation, and general/miscellaneous spending. Housing is typically a person&#39;s biggest expense followed by food or transportation as 2 &amp; 3.</p>\n<h3 id=\"what-does-essential-mean\">What Does &#39;Essential&#39; Mean?</h3>\n<p>We need to be realistic about what we say we <em>need</em> to spend money on. If your monthly estimated food expenses are north of $450 for a single person, daily trips to Starbucks as you head into work might have to be reevaluated. A mode of personal transportation is necessary who doesn&#39;t live in a city that has a robust public transit system. That being said, a lease on a brand new car may not be in line with your income. I&#39;ll be going more into detail about cars and how to calculate what you can afford in another post - but for now, it&#39;s important to be pragmatic and remember that our goal is to <em>save</em> money.</p>\n<h3 id=\"cutting-costs\">Cutting Costs</h3>\n<p>There are number of areas that are typical culprits for high, unnecessary spending. I&#39;ll outline a few here with some tips on reducing these costs to make for a healthier budget.</p>\n<p><strong>Food</strong></p>\n<p>We&#39;ve already brought this up, but it is very common that this is an out-of-control category for most people. Constantly going out for coffee in the morning, out for lunch, and late night drinks at the bar - will easily suck up all of your hard earned money and will put your future-self in a compromised position.</p>\n<p><em>Tip:</em> Focus on bringing more of your meals &#39;in-house&#39;. Grocery shopping and cooking/prepping meals at home is significantly cheaper that eating out. While a single lunch may be $12, you can likely prep that same meal at home for $2-3.</p>\n<p>This doesn&#39;t mean you should never go out to restaurants or bars. It can be a nice treat for yourself and a social event in meeting with friends, but it&#39;s important to realize the inflated costs and to try to make most of your meals at home.</p>\n<p><strong>Transportation</strong></p>\n<p>I also mentioned this one above, but driving around a fancy car that you can&#39;t afford will only lead to stress and less money in your pocket down the road. I&#39;m not just referring to luxury brands - &#39;reasonable&#39; brands like Honda and Toyota can average around $30,000 for a decently spec&#39;d sedan or crossover. $30k at a 3% interest rate for a 5 year loan is ~$540/month. That is a lot of your money getting used up, especially for something that is constantly depreciating in value.</p>\n<p><em>Tip:</em> Buying the same model you were looking at on the lot, but as a used car 2-3 years old will allow someone else to take on the initial hit of depreciation to the car giving you a significant discount for a slightly used vehicle.</p>\n<p>Maintenance is also something that can be a big financial burden as a car gets older. Keep this in mind while picking out a car. The big brands like Honda, Toyota, and Hyundai have a great record of reliability compared to the luxury European competitors.</p>\n<p><strong>Housing</strong></p>\n<p>This one can be a bit more difficult to cut down on depending on your area and what is available at the moment. If you are in a situation where you have a spare room or are in a larger place that you don&#39;t <em>need</em>, either renting out that spare room or moving into a more appropriately-sized apartment/home can give you a few extra hundred dollars in your pocket a month</p>\n<p><strong>Subscriptions</strong></p>\n<p>As subscriptions to digital services (video, shopping, games) are becoming more popular, we can easily ignore how quickly they build up. Combining accounts with family or getting rid of services that you rarely use can make a meaningful impact in decreasing the amount of money flowing out every month.</p>\n<h3 id=\"after-the-essentials-focus-on-savings\">After the Essentials, Focus on Savings</h3>\n<p>Now that we&#39;ve gone through how to evaluate our &#39;essential&#39; items, I&#39;ve updated a couple of my items with better decisions:</p>\n<p>[Updated budget items table]</p>\n<p>In this scenario, let&#39;s say my monthly income after tax is $2,850. With my new adjusted expenses of $2,245, I have $605/month that is not account for...yet.</p>\n<p>There are a few questions that we need to ask ourselves to move forward with how to apply this money:</p>\n<ul>\n<li>Do I have outstanding, high-interest debt? If yes, apply all that you can of your remaining money to pay this down.</li>\n<li>No debts? Do I have a proper emergency fund? Not sure? Check out my post - What&#39;s an Emergency Fund? If you don&#39;t, it&#39;s best if you put this money directly into a savings account.</li>\n<li>No debts? Have an emergency fund? Now it&#39;s time to invest for retirement.</li>\n</ul>\n<p>It is good to create a number that you must save every month. Treat this amount just as you would a bill. For my budget, I will choose to save $500 of my $605 into my emergency fund. I am getting close to reaching my 6-month mark and will plan to switch to retirement investments next.</p>\n<h3 id=\"lastly-spend-the-difference\">Lastly, Spend the Difference</h3>\n<p>Now, I&#39;ve left myself $105 of discretionary money to spend on shopping, travel, or a concert. How this money is spent is totally up to you and should be for something fun! You should feel good knowing that you have properly organized your spending and are allocating a good amount to savings. As you expenses change over time and your income increases, be sure to increase your savings rate proportionally. If you have $1,000+ of leftover money down the road, you won&#39;t want to only be saving the original $500. Be sure to revisit and rebalance your budget as your financial situation changes.</p>\n<h3 id=\"important-keep-with-it\">IMPORTANT, Keep With It!</h3>\n<p>Track, track, track! Like a diet, a budget is only as effective as the person following it. Going back to sitting on the couch instead of spending an hour at the gym can undo months of hard work and discipline.</p>\n<p>There are several apps out there that help with tracking your expenses and breaking down the different categories. I will be writing a post on a few of these options, stay tuned! Alternatively, you can always use a simple spreadsheet or pen &amp; paper. Any method to ensure that you stay on top of every penny that goes in and out is all that counts.</p>\n<p><em>Tip:</em> Set up recurring monthly/bi-monthly reminders in your phone to keep up with your budget. If it is more helpful, get your friend or partner to be the friendly reminder to check in on yourself. Finding someone that is also creating and following a budget can create mutual accountability.</p>\n<h3 id=\"wrapping-up\">Wrapping Up</h3>\n<p>This is a good starting point for evaluating where you stand. I will be writing more on the subject in the future about using different apps to track, moving from cash savings to investment allocation, and tips on cutting back when things can get out of hand.</p>\n<p>Comment and let me know if this is your first budget and how things go. Are there any topics from this post that you want me to explain in more detail?</p>\n<p>Talk to you soon!</p>\n",
      "title": "Building Your First Budget",
      "author": "Seth Mitchell",
      "date": "2021-04-25T14:56:37.130Z",
      "category": "Budgeting",
      "summary": "Achieving a healthier financial standing doesn't start with sporadic spending and ignoring each item on your statement as you pay it month to month. By building and following a budget, you are able to be the one in control and have a strong understanding of what goes in and out of your pocket every month.",
      "thumbnail": "/images/northfolk-ok76f6yw2ia-unsplash.jpg",
      "excerpt": "<p>Achieving a healthier financial standing doesn&apos;t start with sporadic spending and ignoring each item on your statement as you pay it month to month. By building and following a budget, you are able to be the one in control and have a strong understanding of what goes in and out of your pocket every month.</p>",
      "meta": {
        "relativePath": "src/building-your-first-budget.html",
        "createdAt": "2021-04-25T14:59:50.646Z",
        "lastModified": "2021-04-25T14:59:50.646Z",
        "size": 8766,
        "formattedSize": "8.6 KB"
      }
    },
    {
      "id": "src__welcome",
      "contents": "<p>Hello!</p>\n<p>I’m excited to be finally begin sharing content out with the world. I have had a strong interest in personal finance and investing and want to share the knowledge that I’ve gained along the way.</p>\n<p>Working as a designer and software developer, I have a passion about coming into this space to create content and resources for people that is approachable and accessible. Good design goes far beyond something being “pretty”. As I tackle new design problems, reducing resistance for a user as they utilize a tool or digest content can greatly improve how they actually implement that information into their everyday life.</p>\n<p>Personal finance, budgeting, credit cards, investing, and more – I hope that you enjoy the upcoming videos and posts, and I would love to hear about any specific topics you would like to hear more about!</p>\n<p>I’ll keep this intro short, but I look forward to hearing your thoughts. See you soon!</p>\n<p>– Seth</p>\n",
      "title": "Welcome!",
      "author": "Seth Mitchell",
      "date": "2021-03-14T23:52:56.635Z",
      "category": "First Post",
      "summary": "I’m excited to be finally begin sharing content out with the world. I have had a strong interest in personal finance and investing and want to share the knowledge that I’ve gained along the way.",
      "thumbnail": "/images/circle-cropped.png",
      "excerpt": "<p>Hello!</p>",
      "meta": {
        "relativePath": "src/welcome.html",
        "createdAt": "2021-04-18T01:28:14.336Z",
        "lastModified": "2021-04-18T01:28:14.336Z",
        "size": 1288,
        "formattedSize": "1.3 KB"
      }
    },
    {
      "id": "src__whats-an-emergency-fund",
      "contents": "<p>Having a sufficient emergency fund is an essential first step for financial security - and it should not be ignored. 2020 was a prime example of how a bizarre circumstance can pop up when we least expect it and have a drastic impact on our lives. I recently heard the statistic from the Federal Reserve:</p>\n<blockquote>\n<p>40% of Americans cannot afford to cover a $400 emergency expense</p>\n</blockquote>\n<p>In the event of an unplanned medical emergency, auto or home repair — or a global pandemic, it can be very easy for a family to be wiped out without any other choice but to take on debt.</p>\n<p>While saving for retirement, investing in stocks, or even taking a vacation, if you can&#39;t support yourself during a surprise expense, you likely shouldn&#39;t be putting money into these other things. An emergency fund, apart from high-interest debt, should be your first priority while getting your finances in shape.</p>\n<h3 id=\"my-personal-emergency-expense\">My Personal &quot;Emergency&quot; Expense</h3>\n<p>Trust me, this is not a fun step, but you will thank yourself down the road. This money, unlike other savings, is not for a new car, clothes, or travel — but &quot;life&quot; expenses that will inevitably come up. A personal example of this, I recently discovered that my plumbing needed to be redone in order for it to function properly. Even though I had no idea that this was going to be an issue 6 months ago, it cost me close to $5,000.</p>\n<p>I chose this topic to write about because of my recent situation that proves my point. Even though the process of hiring a plumber to diagnose my issue and give me an estimate of what it would cost to fix was not fun, being properly prepared with an emergency fund allowed me to not have to sell any investments or use a credit card that accrued interest.</p>\n<h3 id=\"how-much-should-you-have-saved\">How Much Should You Have Saved?</h3>\n<p>If you do additional searching about emergency funds, you will likely see a variety of numbers and ways to calculate. The most common figure that I hear, and a good rule of thumb, is 3-6 months of your expenses.</p>\n<p>Why 3-6 months? While there can be one-off car or medical emergencies that can be costly, having a month range in your mind is in case anything happens to your regular monthly income. In the event that you are laid off or cannot work due to injury and do not receive pay, your 3-6 month fund will give you some time in order to find another job or survive until you can replace that income somehow.</p>\n<p>For example, let&#39;s say the following items are your monthly recurring expenses:</p>\n<ul>\n<li>Rent: $1,200</li>\n<li>Utilities: $125</li>\n<li>Food: $300</li>\n<li>Car &amp; Gas: $250</li>\n<li>Phone: $75</li>\n</ul>\n<p>With each of these expenses, our total for recurring <em>necessary</em> expenses is $1,950. By &quot;necessary&quot;, I mean no frivolous spending like going out to a bar or shopping online. These expenses are what you have to pay to survive.</p>\n<p>A 3-6 month emergency fund for mandatory monthly expenses of $1,950 would be $5,850 - $11,700. Looking at this number head on, it can definitely be intimidating. It can also take quite a while to achieve. It may be helpful to break it up into smaller chunks. To start, focus on saving just <em>one</em> month of expenses. It will definitely feel good and will motivate you to keep going.</p>\n<h3 id=\"getting-3-months-of-expenses-saved\">Getting 3 Months of Expenses Saved</h3>\n<p>The longer you wait to get started, the more likely you are to have an unexpected situation pop up that requires you to shell out more money than you have on hand. I don&#39;t mean to scare you, but it&#39;s important to understand the importance. Again, you will thank yourself down the road.</p>\n<p>There are likely a number of things that you spend money on month to month that are not essential. Taking a look through a credit or debit card statement to see where your money is going may surprise you. Spending a ton on Amazon or getting takeout most nights instead of cooking at home can really add up. Here, you will have to be honest with yourself about what you are overspending on and be disciplined about stopping. It may be tough to cut out these things, but you will be surprised how quickly the money can build up when you cut back to essentials only. It will be a good illustration of how much money is getting tossed out on things that you don&#39;t really need.</p>\n<p>Getting to 3 months of expenses saved may take 6 months, or 12 months, or more. It really depends on how much extra money you make over and above your necessary expenses. When you hit that 3-month fund mark, celebrate! You are in a much more secure financial position. At this point, it is ok to treat yourself, but just make sure that you continue to tuck away money to head for 6 months.</p>\n<h3 id=\"setbacks-and-temptations\">Setbacks and Temptations</h3>\n<p>Along the way, you might encounter an unexpected expense. You&#39;ve been working hard and have $3,250 saved up and on the way home from work, you get a flat tire. After getting it towed and replaced, you&#39;re back down to $2,925. Don&#39;t be discouraged! If anything, this just proves why you need to keep working on building up for an emergency.</p>\n<p>On the other side of the coin, you&#39;ve been working hard and have close to $4,000 saved up and you decide to buy a new phone when your current one works just fine. $1,100 later, you&#39;ve possibly erased months of diligent saving. If an emergency comes up and requires you to pay $3,500, you no longer have that ready in cash. After using a credit card and paying interest as you continue to save up again, that phone&#39;s actual cost just became a whole lot more expensive!</p>\n<p>While you may see the number continue to grow in your savings account, you should not consider it to be money that you can spend. Unless absolutely necessary, you should not withdraw any money.</p>\n<p>Even when you&#39;ve achieved 3 or 6 month status — as expenses pop up unexpectedly, get into the mindset that rather than pulling from your fund, try to forego a few nights out to dinner in order to pay for a doctor visit copay or a new kitchen appliance.</p>\n<h3 id=\"wrapping-up\">Wrapping Up</h3>\n<p>This is the tough first step. Once you succeed, you will feel much better about your financial future and can begin getting into the more fun things the world of personal finance has to offer!</p>\n<p>Have any questions? Comment and let me know where you currently sit and what challenges you&#39;ve faced along the way.</p>\n<p>Talk to you soon!</p>\n",
      "title": "What's an Emergency Fund?",
      "author": "Seth Mitchell",
      "date": "2021-04-25T14:52:04.679Z",
      "category": "Personal Finance",
      "summary": "Having a sufficient emergency fund is an essential first step for financial security - and it should not be ignored. 2020 was a prime example of how a bizarre circumstance can pop up when we least expect it and have a drastic impact on our lives.",
      "thumbnail": "/images/stephen-phillips-hostreviews-co-uk-em37ks8wjjq-unsplash.jpg",
      "excerpt": "<p>Having a sufficient emergency fund is an essential first step for financial security - and it should not be ignored. 2020 was a prime example of how a bizarre circumstance can pop up when we least expect it and have a drastic impact on our lives. I recently heard the statistic from the Federal Reserve:</p>",
      "meta": {
        "relativePath": "src/whats-an-emergency-fund.html",
        "createdAt": "2021-04-25T14:59:50.647Z",
        "lastModified": "2021-04-25T14:59:50.647Z",
        "size": 6615,
        "formattedSize": "6.5 KB"
      }
    }
  ]
}
